void PrintNUm ( int m, int n)
{
   if (m!=n)
   {
    if(m>n)
    {
    PrintNUm(m-1,n);
    Console.Write(m + " ");
    }
    else if (n>m)
    {
    PrintNUm(m,n-1);
    Console.Write(n + " ");
    }   
    }
    else Console.Write(m+" ");
}
PrintNUm(2,5);

Напишите программу которая принемает два числа а и б и ввозводит число а в натуральную степень числа б с помощью рекурсии
int Stepen (int a, int b)
{
    if (b != 0)
    return a * Stepen(a, b-1);
    else return 1;
}
int result = Stepen (2,3);
Console.WriteLine(result);
